Autodesk.Revit.DB.WorksetTable.IsWorksetNameUnique(Autodesk.Revit.DB.Document,System.String)
Checks if the given workset name is unique in the document.
aDoc:
The document in which the workset is accessed.
name:
The workset name.
Returns:
True if this given workset name is unique in the document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.WorksetTable.RenameWorkset(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.WorksetId,System.String)
Renames the workset.
aDoc:
The document in which the workset is accessed.
worksetId:
The workset Id.
name:
The workset name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
aDoc is not a workshared document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given workset name is already in use.
-or-
There is no workset in the document with this id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update

Autodesk.Revit.DB.WorksetTable.SetActiveWorksetId(Autodesk.Revit.DB.WorksetId)
Sets the active workset.
worksetId:
The workset Id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset in the document with this id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.WorksetTable.GetActiveWorksetId
Returns the active workset's WorksetId.
Returns:
WorksetId of the active workset.
Since:
2012

Autodesk.Revit.DB.WorksetTable.GetWorkset(System.Guid)
Returns the workset from a input Guid.
guid:
Guid of the workset.
Returns:
The returned workset. null if there is no workset in this table with this Id.
Since:
2012

Autodesk.Revit.DB.WorksetTable.GetWorkset(Autodesk.Revit.DB.WorksetId)
Returns the workset from a input WorksetId.
id:
Id of a workset.
Returns:
The returned workset. null if there is no workset in this table with this Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksetTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksetTable
A table containing references to all the worksets contained in a document.
Remarks:
There is one WorksetTable for each document.
There will be at least one default workset in the table, even if worksharing has not been enabled in the document.
Since:
2012